In [2]:
# Ambiente um Alô mundo!

print("Alo munso!")

Alo munso!

SqlALchemy é uma biblioteca de ORM

Conexao facil .
Mapeamento de tabela com classe (ORM)
Resolve um conflito de tecnologia com paradigmas diferentes.
Tudo fique orientado a objeto.

In [3]:
! pip freeze > requereriments.txt

In [4]:
! pip install sqlalchemy

Requirement already satisfied: sqlalchemy in c:\users\ead\desktop\projeto final manhã\.venv\lib\site-packages (2.0.31)
Requirement already satisfied: typing-extensions>=4.6.0 in c:\users\ead\desktop\projeto final manhã\.venv\lib\site-packages (from sqlalchemy) (4.12.2)
Requirement already satisfied: greenlet!=0.4.17 in c:\users\ead\desktop\projeto final manhã\.venv\lib\site-packages (from sqlalchemy) (3.0.3)

In [5]:
! pip install pandas

Requirement already satisfied: pandas in c:\users\ead\desktop\projeto final manhã\.venv\lib\site-packages (2.2.2)
Requirement already satisfied: numpy>=1.26.0 in c:\users\ead\desktop\projeto final manhã\.venv\lib\site-packages (from pandas) (2.0.1)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\ead\desktop\projeto final manhã\.venv\lib\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\ead\desktop\projeto final manhã\.venv\lib\site-packages (from pandas) (2024.1)
Requirement already satisfied: tzdata>=2022.7 in c:\users\ead\desktop\projeto final manhã\.venv\lib\site-packages (from pandas) (2024.1)
Requirement already satisfied: six>=1.5 in c:\users\ead\desktop\projeto final manhã\.venv\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)

In [6]:
! pip install pymysql

Requirement already satisfied: pymysql in c:\users\ead\desktop\projeto final manhã\.venv\lib\site-packages (1.1.1)

In [7]:
import pandas as pd

In [8]:
from sqlalchemy import create_engine

In [9]:
import pymysql

 Senha?
 - password: senai@123

In [10]:
# biblioteca para converter e resolver o problema do @
import urllib.parse

# Qual o usuario do banco e a senha?
user = 'root'


password= urllib.parse.quote_plus('senai@123')
#password=''

# Qual o host e o banco?
host = 'localhost'
database= 'projetodiario1'

# connection_string: string com todas as informaçoes da conexao

connection_string = f'mysql+pymysql://{user}:{password}@{host}/{database}'

# criando a conexao 
engine = create_engine(connection_string) 

# Escrever uma consulta SQL
quezy_alunos="SELECT * FROM aluno"

# criar um dataframe com uma consulta SQL
df_alunos = pd.read_sql(quezy_alunos, engine)

df_alunos

# Mostrar

    id        ra      nome  tempoestudo  rendafamiliar
0    1  12345678      None            0            NaN
1    4  12322678      None            0            NaN
2    5  12333678      None            0            NaN
3    6  12346678      None            0            NaN
4    7  12388678      None            0            NaN
..  ..       ...       ...          ...            ...
75  86  66259989  Aluno 46           12         4600.0
76  87  66343339  Aluno 47           15         5100.0
77  88  66366589  Aluno 48            8         3600.0
78  89  66666890  Aluno 49           10         4300.0
79  90  66259990  Aluno 50           12         4700.0

[80 rows x 5 columns]

Biblioteca para Data Science

- pandas (EDA - Analise Exploratorio de Dados)
- Scikit-Learn (Fundamentos de Inteligencia Artificial)
- Numpy(Matemática Complexa com Abstração)

Salvando o DtaFrame

-..CSV
- .XLSX
- .JSON
- .SQL
- .HTML
- .XML

In [11]:
csv_filename = "alunos.csv"
df_alunos.to_csv(csv_filename,index=False)

# Crie uma nova célula que salve o DataFrame no formato .JSON

In [12]:

json_filename = "alunos,json"
df_alunos.to_json(json_filename,index=False)

um novo dataframe

In [13]:
df_alunos.columns

Index(['id', 'ra', 'nome', 'tempoestudo', 'rendafamiliar'], dtype='object')

Explicação:
df-tempo_renda = df_alunos[['tempoestudo','rendafamiliar']]

df_tempo_renda

In [14]:
df_tempo_renda = df_alunos[['tempoestudo','rendafamiliar']]
df_tempo_renda

    tempoestudo  rendafamiliar
0             0            NaN
1             0            NaN
2             0            NaN
3             0            NaN
4             0            NaN
..          ...            ...
75           12         4600.0
76           15         5100.0
77            8         3600.0
78           10         4300.0
79           12         4700.0

[80 rows x 2 columns]

In [15]:
df_tempo_renda

    tempoestudo  rendafamiliar
0             0            NaN
1             0            NaN
2             0            NaN
3             0            NaN
4             0            NaN
..          ...            ...
75           12         4600.0
76           15         5100.0
77            8         3600.0
78           10         4300.0
79           12         4700.0

[80 rows x 2 columns]

In [16]:
type(df_tempo_renda)

pandas.core.frame.DataFrame

Exercício: Como mostrar os registros do DataFrama usando fatiamento

In [17]:
len(df_alunos)

80

In [18]:

df_alunos[0:30]

    id        ra  nome  tempoestudo  rendafamiliar
0    1  12345678  None            0            NaN
1    4  12322678  None            0            NaN
2    5  12333678  None            0            NaN
3    6  12346678  None            0            NaN
4    7  12388678  None            0            NaN
5    8  14456788  None            0            NaN
6    9  12345555  None            0            NaN
7   10  11345678  None            0            NaN
8   11  13345678  None            0            NaN
9   12  12355678  None            0            NaN
10  13  12345578  None            0            NaN
11  14   1234678  None            0            NaN
12  15  19345678  None            0            NaN
13  16  12634678  None            0            NaN
14  17   1234848  None            0            NaN
15  18  12314678  None            0            NaN
16  19  12325678  None            0            NaN
17  20  12348578  None            0            NaN
18  21  12346478  None            0            NaN
19  22  12346548  None            0            NaN
20  23  12255678  None            0            NaN
21  24  12554567  None            0            NaN
22  25  12336267  None            0            NaN
23  26  12665678  None            0            NaN
24  30  12322578  None            0            NaN
25  31  12333178  None            0            NaN
26  36  12666878  None            0            NaN
27  37  12259978  None            0            NaN
28  38  12343328  None            0            NaN
29  39  12366578  None            0            NaN

# Crie uma serie apenas com a renda familiar?

In [19]:
df_tempo_renda = df_alunos[['rendafamiliar']]
df_tempo_renda

    rendafamiliar
0             NaN
1             NaN
2             NaN
3             NaN
4             NaN
..            ...
75         4600.0
76         5100.0
77         3600.0
78         4300.0
79         4700.0

[80 rows x 1 columns]

In [20]:
renda_familiar = df_alunos[['rendafamiliar']]
type(renda_familiar)

pandas.core.frame.DataFrame

- Funções Basicas

1° Retorne as duas primeiras linhas de um dataframe.

In [21]:
df_alunos.head(2)

   id        ra  nome  tempoestudo  rendafamiliar
0   1  12345678  None            0            NaN
1   4  12322678  None            0            NaN

In [22]:
df_alunos[1:3]

   id        ra  nome  tempoestudo  rendafamiliar
1   4  12322678  None            0            NaN
2   5  12333678  None            0            NaN

In [23]:
df_alunos.iloc[1]

id                      4
ra               12322678
nome                 None
tempoestudo             0
rendafamiliar         NaN
Name: 1, dtype: object

 2. Retorne as ultimas duas linhas da amostra

In [25]:
df_alunos.tail(2)

    id        ra      nome  tempoestudo  rendafamiliar
78  89  66666890  Aluno 49           10         4300.0
79  90  66259990  Aluno 50           12         4700.0

In [26]:
df_alunos[78:80]

    id        ra      nome  tempoestudo  rendafamiliar
78  89  66666890  Aluno 49           10         4300.0
79  90  66259990  Aluno 50           12         4700.0

In [27]:
df_alunos.iloc[-2]

id                     89
ra               66666890
nome             Aluno 49
tempoestudo            10
rendafamiliar      4300.0
Name: 78, dtype: object

Exercicio 03: retorne uma tupla com numeros de linhas e colunas

In [28]:
df_alunos.shape

(80, 5)

In [29]:
df_alunos.columns

Index(['id', 'ra', 'nome', 'tempoestudo', 'rendafamiliar'], dtype='object')

In [30]:
df_alunos.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 80 entries, 0 to 79
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   id             80 non-null     int64
 1   ra             80 non-null     object
 2   nome           50 non-null     object
 3   tempoestudo    80 non-null     int64
 4   rendafamiliar  50 non-null     float64
dtypes: float64(1), int64(2), object(2)
memory usage: 3.3+ KB

In [31]:
df_alunos.describe()

              id  tempoestudo  rendafamiliar
count  80.000000    80.000000      50.000000
mean   47.900000     7.025000    3850.000000
std    26.397929     5.837407     659.699994
min     1.000000     0.000000    2500.000000
25%    22.750000     0.000000    3400.000000
50%    50.500000     8.000000    3900.000000
75%    70.250000    12.000000    4300.000000
max    90.000000    15.000000    5100.000000

# Uniao

- concat()
- merge()

crie um novo DataFrame da tabela diariobordo do Mysol

In [35]:
# Escrever uma consulta SQL
query_diariobordo="SELECT * FROM diariobordo"

# criar um dataframe com uma consulta SQL
df_diariobordo = pd.read_sql(query_diariobordo, engine)

df_diariobordo

# Mostrar

   id       texto            datahora  fk_aluno_id
0   3  aula legal 2024-08-01 09:16:00            1

In [36]:
# Escrever uma consulta SQL
query_avaliacao="SELECT * FROM avaliacao"

# criar um dataframe com uma consulta SQL
df_avaliacao = pd.read_sql(query_avaliacao, engine)

df_avaliacao

# Mostrar

   id  nota1  nota2  nota3  nota4  fk_aluno_id
0   1      9      8      7     10            1
1   2      7      9      7      8            2
2   3      8      8      7      9            3
3   4     10      8      7     10            4
4   5      6      7      7      9            5

In [41]:
resultado = pd.merge(df_diariobordo, df_alunos, how='left' , left_on='fk_aluno_id', right_on='id')
resultado

,id_x,texto,datahora,fk_aluno_id,id_y,ra,nome,tempoestudo,rendafamiliar
0,3,aula legal,2024-08-01 09:16:00,1,1,12345678,None,0,NaN